FROM python:3.12-slim

# Шаг 2: Устанавливаем рабочую директорию внутри контейнера
# Все последующие команды будут выполняться относительно этой директории
WORKDIR /app

# Шаг 3: Копируем файл зависимостей в контейнер
# Копируем только requirements.txt сначала, чтобы закэшировать установку пакетов
COPY requirements.txt .

# Шаг 4: Устанавливаем зависимости Python из requirements.txt
# --no-cache-dir экономит место, не сохраняя установочные кэши
RUN pip install --no-cache-dir -r requirements.txt

# Шаг 5: Копируем все остальные файлы проекта в рабочую директорию контейнера
# .dockerignore предотвратит копирование ненужных файлов
COPY . .

# Шаг 6: Создаем директории, которые могут понадобиться приложению
RUN mkdir -p tmp logs report/output/images && chmod a+rwx logs

# Шаг 7: Указываем команду по умолчанию для запуска приложения при старте контейнера
# main.py запускает Gradio-приложение
CMD ["python", "main.py"]